niranjannt/TM4C-IOT-Alarm-Clock/sw/src_TM4C/Lab4E_Main.c
// -------------------------------------------------------------------
// File name:     Lab4E_Main.c
// Description:   This code is the main loop for the new MQTT Clock Control IOT Lab
//               
// Authors:       Mark McDermott
// Date:          June 6, 2023
//
// 

#include <stdio.h>
#include <stdint.h>

#include "inc/tm4c123gh6pm.h"
#include "inc/ST7735.h"
#include "inc/PLL.h"
#include "inc/Timer2A.h"
#include "inc/Timer5A.h"
#include "inc/UART.h"
#include "inc/UART5.h"
#include "inc/esp8266_base.h"
#include "inc/MQTT.h"
#include "inc/Unified_Port_Init.h"
#include "Lab4E_Main.h"
// ---------- Prototypes   -------------------------
void DisableInterrupts(void); // Disable interrupts
void EnableInterrupts(void);  // Enable interrupts
void WaitForInterrupt(void);
char volatile hours=1;
char volatile minutes=12;
char volatile seconds=59;
char volatile isPM=0;
char volatile timecounter;
char volatile timecycle;
char volatile digital;
char volatile erase;
char volatile freeze;
//char volatile set;
char volatile timecycleset;
char volatile alarmhours=1;
char volatile alarmminutes=12;
char volatile alarmseconds=59;
char volatile alarmisPM=0;
char volatile alarmsetdone=0;
char volatile alarm_display=0;
//char volatile alarmupdate;
char volatile alarmdisablecheck=1;
char volatile alarmsound=0;
char volatile tickflag=0;
char volatile stopfreezealarm, stopfreezereleasealarm=0;
char volatile changeclockruntworelease=0;
char volatile changeclockruntwo=0;
char volatile twentyfourhours=0;
static uint16_t digitalcolors[]={ST7735_BLUE, ST7735_RED, ST7735_GREEN, ST7735_YELLOW, ST7735_CYAN, ST7735_MAGENTA};
char volatile colorindex=0;
char volatile timesetdone=0;

void displayScreen(void);
void EnableInterrupts(void);  // Enable interrupts
void drawAnalogHands(void);
#include "Sound.h"
#include "Switch.h"
#include "LED.h"
#include "LCD.h"


//uint32_t         Mode_Value;      //
//uint32_t         Left_Value;      //
//uint32_t         Right_Value;     //
//uint32_t         Up_Value;        //
//uint32_t         Down_Value;      //


//----- Prototypes of functions in startup.s  ----------------------
//
void DisableInterrupts(void); // Disable interrupts
void EnableInterrupts(void);  // Enable interrupts
long StartCritical (void);    // previous I bit, disable interrupts
void EndCritical(long sr);    // restore I bit to previous value
void WaitForInterrupt(void);  // Go into low power mode
void ADC_Init(void);
int32_t ADC_In(void);
int32_t IR_Convert(int32_t n);




void pause(void){
	while((PF0==0x01)&&(PF4==0x10)){
		for(int32_t i=0; i<0x80000; i++){
		}
	}
	while(!((PF0==0x01)&&(PF4==0x10))){
		for(int32_t i=0; i<0x80000; i++){
		}
	}
}

// -----------------------------------------------------------------
// -------------------- MAIN LOOP ----------------------------------
//
int main(void){  
  DisableInterrupts();            // Disable interrupts until finished with inits     
  PLL_Init(Bus80MHz);             // Bus clock at 80 MHz
  UART_Init();                    // Allow us to talk to the PC via PuTTy!
  UART5_Init();                   // Enable ESP8266 Serial Port
  ST7735_InitR(INITR_REDTAB);     // Start up display.
  Unified_Port_Init();						// Initialize the Ports used for this lab
	
	ST7735_OutString("Reseting ESP\n");
  Reset_8266();                   // Reset the WiFi module
  SetupWiFi();                    // Setup communications to MQTT Broker via 8266 WiFi
	
  Timer2A_Init(&MQTT_to_TM4C, 400000, 7);         // Check/Get data from the ESP every 5ms 
  Timer5A_Init(&TM4C_to_MQTT, 80000000, 7);       // Send data back to MQTT Web App every second 
  
 // EnableInterrupts();
	  ST7735_InitR(INITR_REDTAB);
    Switch_Init();
	  DAC5_Init();
    LED_Init();

	ST7735_SetCursor(0,10);
	ST7735_OutString("Press SW to toggle mode:");

  //Integrate your lab 3 here
	
	
	
	    uint32_t cycle_release=0, cycle_press=0;
    uint32_t increment_cycle=0, increment_cycle_release=0;
	uint32_t changeclock=0, changeclock_release, timeset, timesetlast, alarmset, alarmsetrelease, alarmdisable, alarmdisablerelease, setalarmrun, setalarmrundone =0;
	uint32_t changeclock_runrelease, changeclockrun=0;
	uint32_t stopfreeze, stopfreezerelease=0;
	uint32_t decrement_cycle, decrement_cycle_release=0;
	uint32_t colorchange, colorchangerelease=0;
uint32_t setalarmrundisable=128;

	
	

	

    while(timesetdone==0){
			    // set=1;
//	    if(timecycleset){		
//			switch(timecycle){
//				case 0: 	hours = (hours % 12) + 1;
//				case 1: minutes=(minutes+1)%60;
//				
//				
//			}
//		}
			FillTransmitBuffer();
			ReceiveTransmitBuffer();
			colorchange=Switch_In6();
			if((colorchange==1) && (colorchangerelease==0)){
				
				colorindex=(colorindex+1)%6;
				colorchangerelease=colorchange;
				
				
			}
			
			else if((colorchangerelease=1) && (colorchange==0)){

        colorchangerelease=colorchange;




			}				
			
			//Debugged/Wrote Decrement Counter with ChatGPT
			   decrement_cycle=Switch_In4();
        if((decrement_cycle_release == 0) && (decrement_cycle==64)){
				if(timecycle==0){
            hours = ((hours - 2 + 12) % 12) + 1;
            decrement_cycle_release=decrement_cycle;
						}
						else if(timecycle==1){
							minutes = ((minutes - 1 + 60) % 60);
							decrement_cycle_release=decrement_cycle;

							
						}
						else if(timecycle==2){
					   seconds=((seconds-1+60)%60);
             decrement_cycle_release=decrement_cycle;

							
						}
						else if(timecycle==3){
				if(isPM){
              isPM=0;
          }
          else{
              isPM=1;
          }
          decrement_cycle_release=decrement_cycle;
      }
        }
        else if((decrement_cycle_release == 64) && (decrement_cycle==0)){
				 decrement_cycle_release = decrement_cycle;
	  
	
							
						}

			
          increment_cycle=Switch_In();
        if((increment_cycle_release == 0) && (increment_cycle==32)){
				if(timecycle==0){
            hours = (hours % 12) + 1;
            increment_cycle_release=increment_cycle;
						}
						else if(timecycle==1){
							minutes=(minutes+1)%60;
							increment_cycle_release=increment_cycle;

							
