niranjannt/TM4C-IOT-Alarm-Clock/sw/src_TM4C/Lab4E_Main.c
						}
						else if(timecycle==2){
					   seconds=(seconds+1)%60;
             increment_cycle_release=increment_cycle;

							
						}
						else if(timecycle==3){
				if(isPM){
              isPM=0;
          }
          else{
              isPM=1;
          }
          increment_cycle_release=increment_cycle;
      }
        }
        else if((increment_cycle_release == 32) && (increment_cycle==0)){
				 increment_cycle_release = increment_cycle;
	  
	
							
						}
        

       //displayScreen();


         cycle_press=Switch_In1();
       if((cycle_release == 0) && (cycle_press==16)){
				timecycle=(timecycle+1)%4;
       cycle_release = cycle_press;
       }
       else if((cycle_release == 16) && (cycle_press==0)){
				   cycle_release = cycle_press;

				 
       }
			 
			 
			 changeclock=Switch_In3();
			 if((changeclock == 64) && (changeclock_release == 0)){
				 
				 changeclock_release = changeclock;
				 
				 
			 }
			 else if((changeclock_release == 64) && (changeclock == 0)){
        digital=(digital+1)%3;
				 erase=1;
        changeclock_release = changeclock;


			 }				 
			 
			 
			 timeset=Switch_In5(); //Change to Switch_In3() as this is for testing
			if((timesetlast == 0) && (timeset==128)){
      timesetlast = timeset;
      }
      else if((timesetlast == 128) && (timeset==0)){
			timesetdone=1;
			timesetlast=timeset;


    }
			
		alarmset=Switch_In2(); //Change to Switch_In4() as this is for testing
		if((alarmsetrelease == 0) && (alarmset == 128) && (alarmsetdone==0)){
		
			alarmsetrelease = alarmset;
			
			
			
		}
else if((alarmset == 0) && (alarmsetrelease == 128) && (alarmsetdone==0)){
	//alarmsetrelease=alarmset;
		ST7735_FillScreen(ST7735_BLACK);
		ST7735_DrawCharS(27, 120, 'A', digitalcolors[colorindex], ST7735_BLACK, 2);
    ST7735_DrawCharS(47, 120, 'L', digitalcolors[colorindex], ST7735_BLACK, 2);
        ST7735_DrawCharS(67, 120, 'A', digitalcolors[colorindex], ST7735_BLACK, 2);
        ST7735_DrawCharS(87, 120, 'R', digitalcolors[colorindex], ST7735_BLACK, 2);
        ST7735_DrawCharS(107, 120, 'M', digitalcolors[colorindex], ST7735_BLACK, 2);
			  uint32_t alarmsetpressed, alarmsetreleased=0;
	      uint32_t alarmback, alarmbackreleased=0;
	      uint32_t decrement_cycle_release_alarm, decrement_cycle_alarm=0;
			  while(alarmsetdone==0){
				//tickflag=0;
				alarm_display=1;
				decrement_cycle_alarm=Switch_In4();
        if((decrement_cycle_release_alarm == 0) && (decrement_cycle_alarm==64)){
				if(timecycle==0){
            alarmhours = ((alarmhours - 2 + 12) % 12) + 1;
            decrement_cycle_release_alarm=decrement_cycle_alarm;
						}
						else if(timecycle==1){
							alarmminutes = ((alarmminutes - 1 + 60) % 60);
							decrement_cycle_release_alarm=decrement_cycle_alarm;

							
						}
						else if(timecycle==2){
					   alarmseconds=((alarmseconds-1+60)%60);
             decrement_cycle_release_alarm=decrement_cycle_alarm;

							
						}
						else if(timecycle==3){
				if(isPM){
              isPM=0;
          }
          else{
              isPM=1;
          }
          decrement_cycle_release_alarm=decrement_cycle_alarm;
      }
        }
        else if((decrement_cycle_release_alarm == 64) && (decrement_cycle_alarm==0)){
				 decrement_cycle_release_alarm = decrement_cycle_alarm;
	  
	
							
						}

			  increment_cycle=Switch_In();
        if((increment_cycle_release == 0) && (increment_cycle==32)){
				if(timecycle==0){
            alarmhours = (alarmhours % 12) + 1;
            increment_cycle_release=increment_cycle;
						}
						else if(timecycle==1){
							alarmminutes=(alarmminutes+1)%60;
							increment_cycle_release=increment_cycle;

							
						}
						else if(timecycle==2){
					   alarmseconds=(alarmseconds+1)%60;
             increment_cycle_release=increment_cycle;

							
						}
						else if(timecycle==3){
				if(alarmisPM){
              alarmisPM=0;
          }
          else{
              alarmisPM=1;
          }
          increment_cycle_release=increment_cycle;
      }
        }
        else if((increment_cycle_release == 32) && (increment_cycle==0)){
				 increment_cycle_release = increment_cycle;
	  
	
							
						}
        

       //displayScreen();


         cycle_press=Switch_In1();
       if((cycle_release == 0) && (cycle_press==16)){
				timecycle=(timecycle+1)%4;
       cycle_release = cycle_press;
       }
       else if((cycle_release == 16) && (cycle_press==0)){
				   cycle_release = cycle_press;

				 
       }
			 
			 alarmsetpressed=Switch_In2();
			 if((alarmsetpressed==128) && (alarmsetreleased==0)){
				 alarmsetreleased=alarmsetpressed;
				 
				 
			 }
			 else if((alarmsetpressed==0) && (alarmsetreleased==128)){
         
				 alarmsetreleased=alarmsetpressed;
				 alarmsetdone=1;
				 ST7735_FillScreen(ST7735_BLACK);
				 alarm_display=0;
				 //alarmupdate=1;
				 //alarmsound=0;
				 alarmdisablecheck=0;

					
				 
				 }
			 
				 
				 alarmback=Switch_In5();
			 if((alarmback==128) && (alarmbackreleased==0)){
//				 		ST7735_DrawCharS(27, 120, 'B', ST7735_YELLOW, ST7735_BLACK, 2);
//    ST7735_DrawCharS(47, 120, 'A', ST7735_YELLOW, ST7735_BLACK, 2);
//        ST7735_DrawCharS(67, 120, 'C', ST7735_YELLOW, ST7735_BLACK, 2);
//        ST7735_DrawCharS(87, 120, 'K', ST7735_YELLOW, ST7735_BLACK, 2);
//        ST7735_DrawCharS(107, 120, 'M', ST7735_YELLOW, ST7735_BLACK, 2);
				 alarmbackreleased=alarmback;
				 
				 
			 }
			 else if((alarmback==0) && (alarmbackreleased==128)){
				           
					 
				 
				 alarmbackreleased=alarmback;
				 alarmsetdone=1;
				 ST7735_FillScreen(ST7735_BLACK);
				 alarm_display=0;
				 alarmdisablecheck=1;
				// alarmupdate=0;
				// alarmsound=0;


				 
				 }
			 
			       displayScreen();

		 }
	
	
				alarmsetrelease = alarmset;

	
}
      
        




      displayScreen();



    }

  while(1){ 
//		ST7735_SetCursor(0,11);
//		ST7735_OutString("Mode is now:    ");
//		ST7735_SetCursor(13,11);
//		ST7735_OutUDec( Mode_Value );
//		Mode_Value ^= 0x01;
//		pause();
			FillTransmitBuffer();
			ReceiveTransmitBuffer();

		        displayScreen();
		 setalarmrundone=0;
		 //Disable alarm/set alarm
		 //Change color of text
		 //Change to military time
		 //Change to analog clock
		 
//		 		stopfreeze=Switch_In4();
//		if((stopfreeze==64) && (stopfreezerelease==0)){
//			stopfreezerelease=stopfreeze;
//			
//			

//}
//if((stopfreeze==0) && (stopfreezerelease==64)){
//	    freeze=0;
//	    alarmsound=0;
//			stopfreezerelease=stopfreeze;
//			
//			
	colorchange=Switch_In6();
			if((colorchange==1) && (colorchangerelease==0)){
				
				colorindex=(colorindex+1)%6;
				colorchangerelease=colorchange;
				
				
