niranjannt/TM4C-IOT-Alarm-Clock/sw/src_TM4C/Lab4E_Main.c
			}
			
			else if((colorchangerelease=1) && (colorchange==0)){

        colorchangerelease=colorchange;




			}				

		 alarmdisable=Switch_In4();
		 if((alarmdisable==64) && (alarmdisablerelease==0)){
			//alarmsound=0;
		 alarmdisablerelease=alarmdisable;
    }
	  else if((alarmdisablerelease==64)&(alarmdisable==0)){
			alarmdisablecheck=1;
			alarmdisablerelease=alarmdisable;
			
			
		}
		setalarmrun=Switch_In2();
		if((setalarmrun==0) && (setalarmrundisable==128) && (setalarmrundone==0)){
			setalarmrundisable=setalarmrun;
			
			
		}
		else if((setalarmrun==128) && (setalarmrundisable==0) && (setalarmrundone==0)){
			  setalarmrundisable=setalarmrun;
			//alarmupdate=0;
        		ST7735_FillScreen(ST7735_BLACK);
		ST7735_DrawCharS(27, 120, 'A', digitalcolors[colorindex], ST7735_BLACK, 2);
    ST7735_DrawCharS(47, 120, 'L', digitalcolors[colorindex], ST7735_BLACK, 2);
        ST7735_DrawCharS(67, 120, 'A', digitalcolors[colorindex], ST7735_BLACK, 2);
        ST7735_DrawCharS(87, 120, 'R', digitalcolors[colorindex], ST7735_BLACK, 2);
        ST7735_DrawCharS(107, 120, 'M', digitalcolors[colorindex], ST7735_BLACK, 2);
			  uint32_t alarmsetpressed=0;
			uint32_t alarmsetreleased=128;
			  uint32_t alarmback, alarmbackreleased=0;
			uint32_t decrement_cycle_run_release, decrement_cycle_run=0;
			  while(setalarmrundone==0){
					tickflag=0;
				alarm_display=1;
								decrement_cycle_run=Switch_In4();
        if((decrement_cycle_run_release == 0) && (decrement_cycle_run==64)){
				if(timecycle==0){
            alarmhours = (alarmhours - 2 + 12) % 12 + 1;
            decrement_cycle_run_release=decrement_cycle_run;
						}
						else if(timecycle==1){
							alarmminutes = (alarmminutes - 1 + 60) % 60;
							decrement_cycle_run_release=decrement_cycle_run;

							
						}
						else if(timecycle==2){
					   alarmseconds=(alarmseconds-1+60)%60;
             decrement_cycle_run_release=decrement_cycle_run;

							
						}
						else if(timecycle==3){
				if(isPM){
              isPM=0;
          }
          else{
              isPM=1;
          }
          decrement_cycle_run_release=decrement_cycle_run;
      }
        }
        else if((decrement_cycle_run_release == 64) && (decrement_cycle_run==0)){
				 decrement_cycle_run_release = decrement_cycle_run;
	  
	
							
						}

			  increment_cycle=Switch_In();
        if((increment_cycle_release == 0) && (increment_cycle==32)){
				if(timecycle==0){
            alarmhours = (alarmhours % 12) + 1;
            increment_cycle_release=increment_cycle;
						}
						else if(timecycle==1){
							alarmminutes=(alarmminutes+1)%60;
							increment_cycle_release=increment_cycle;

							
						}
						else if(timecycle==2){
					   alarmseconds=(alarmseconds+1)%60;
             increment_cycle_release=increment_cycle;

							
						}
						else if(timecycle==3){
				if(alarmisPM){
              alarmisPM=0;
          }
          else{
              alarmisPM=1;
          }
          increment_cycle_release=increment_cycle;
      }
        }
        else if((increment_cycle_release == 32) && (increment_cycle==0)){
				 increment_cycle_release = increment_cycle;
	  
	
							
						}
        

       //displayScreen();


         cycle_press=Switch_In1();
       if((cycle_release == 0) && (cycle_press==16)){
				timecycle=(timecycle+1)%4;
       cycle_release = cycle_press;
       }
       else if((cycle_release == 16) && (cycle_press==0)){
				   cycle_release = cycle_press;

				 
       }
			 
			 alarmsetpressed=Switch_In2(); //change to Switch_In5() for testing
			 if((alarmsetpressed==0) && (alarmsetreleased==128)){
				 alarmsetreleased=alarmsetpressed;
				 
				 
			 }
			 else if((alarmsetpressed==128) && (alarmsetreleased==0)){
				 alarmsetreleased=alarmsetpressed;
				 setalarmrundone=1;
				 ST7735_FillScreen(ST7735_BLACK);
				 alarm_display=0;
				 //alarmupdate=1;
				 //alarmsound=1;
				 alarmdisablecheck=0;


				 
				 }
			 alarmback=Switch_In5();
			 if((alarmback==128) && (alarmbackreleased==0)){
				 alarmbackreleased=alarmback;
				 
				 
			 }
			 else if((alarmback==0) && (alarmbackreleased==128)){
         
				 alarmbackreleased=alarmback;
				 setalarmrundone=1;
				 ST7735_FillScreen(ST7735_BLACK);
				 alarm_display=0;
				 alarmdisablecheck=1;
				 //alarmupdate=0;
				 //alarmsound=0;


				 
				 }
			 
			       displayScreen();

		 }

			//setalarmrundisable=setalarmrun;

			
			
		}
	 changeclockruntwo=Switch_In3();
			 if((changeclockruntwo == 64) && (changeclockruntworelease == 0)){
				 
				 changeclockruntworelease = changeclockruntwo;
				 
				 
			 }
			 else if((changeclockruntworelease == 64) && (changeclockruntwo == 0)){
        digital=(digital+1)%3;
				 erase=1;
        changeclockruntworelease = changeclockruntwo;


			 }					
		


	 }

  }


void ADC_Init(void){
// write this
	  SYSCTL_RCGCADC_R |= 0x0001;   // 1) activate ADC0
  SYSCTL_RCGCGPIO_R |= 2;    // 2) activate clock for Port B
  while((SYSCTL_PRGPIO_R&2) != 2){};  // 3 for stabilization
  GPIO_PORTB_DIR_R &= ~0x20;    // 4) make PE4 input
  GPIO_PORTB_AFSEL_R |= 0x20;   // 5) enable alternate function on PB4
  GPIO_PORTB_DEN_R &= ~0x20;    // 6) disable digital I/O on PB4
  GPIO_PORTB_AMSEL_R |= 0x20;   // 7) enable analog functionality on PB4
while((SYSCTL_PRADC_R&0x0001) != 0x0001){}; // good code, but not implemented in simulator
  ADC0_PC_R &= ~0xF;
  ADC0_PC_R |= 0x1;             // 8) configure for 125K samples/sec
  ADC0_SSPRI_R = 0x0123;        // 9) Sequencer 3 is highest priority
  ADC0_ACTSS_R &= ~0x0008;      // 10) disable sample sequencer 3
  ADC0_EMUX_R &= ~0xF000;       // 11) seq3 is software trigger
  ADC0_SSMUX3_R &= ~0x000F;
  ADC0_SSMUX3_R += 11;           // 12) set channel
  ADC0_SSCTL3_R = 0x0006;       // 13) no TS0 D0, yes IE0 END0
  ADC0_IM_R &= ~0x0008;         // 14) disable SS3 interrupts
  ADC0_ACTSS_R |= 0x0008;       // 15) enable sample sequencer 3


}


int32_t ADC_In(void){
uint32_t result;
  ADC0_PSSI_R = 0x0008;            // 1) initiate SS3
  while((ADC0_RIS_R&0x08)==0){};   // 2) wait for conversion done
  result = ADC0_SSFIFO3_R&0xFFF;   // 3) read result
  ADC0_ISC_R = 0x0008;             // 4) acknowledge completion
  return result;

