niranjannt/TM4C-IOT-Alarm-Clock/sw/src_TM4C/Lab4E_Main.c
}

// d = A/(ADCvalue+B);
// short range IR GP2Y0A41SK0F
//#define A 264336
//#define B -175
//#define IRmax 2552
//#define Dmax 400
// long range IR GP2Y0A21YK0F
// ***Calibrate your sensor, DO NOT USE THESE VALUES***
#define A 293152
#define B -214
#define IRmax 900
#define Dmax 400
int32_t IR_Convert(int32_t n){  // returns distance in mm
    // write this
  
    return 42;
}


char volatile laststate=0; 
void displayScreen(){
	 //start=NVIC_ST_CURRENT_R;
	  while(freeze){};
	  if(erase){
			erase=0;
			ST7735_FillScreen(ST7735_BLACK);
			
		}
		//Alarm Disable Check debugged/written with ChatGPT
		if(!alarm_display){
		if(alarmdisablecheck==1){
			if(laststate==0){
	     ST7735_DrawBitmap(20, 140, coveralarm, 26, 23);
			laststate=1;
			
			
		}
	 ST7735_DrawBitmap(20, 140, noalarm, 26, 23);	

	}
		
		 if(alarmdisablecheck==0){
			 if(laststate==1){
		 ST7735_DrawBitmap(20, 140, coveralarm, 26, 23);
		 laststate=0;
	
			
			 }
		ST7735_DrawBitmap(20, 140, alarm, 26, 23);

		}
	}
	  if(digital==0){
    //ST7735_InvertDisplay(1); //Comment out for Adafruit
    char timearray[6];
		if(alarm_display){
		if(alarmhours>9){
      timearray[0]=alarmhours/10+'0';
      timearray[1]=alarmhours%10+'0';

    }
    else if(alarmhours<=9){
      timearray[0]='0';
      timearray[1]=alarmhours+'0';

    }

    if(alarmminutes>9){
      timearray[2]=alarmminutes/10+'0';
      timearray[3]=alarmminutes%10+'0';
    }

    else if(alarmminutes<=9){
      timearray[2]='0';
      timearray[3]=alarmminutes+'0';

    }
    if(alarmseconds>9){
      timearray[4]=alarmseconds/10+'0';
      timearray[5]=alarmseconds%10+'0';
    }
    else if(alarmseconds<=9){
     timearray[4]='0';
     timearray[5]=alarmseconds+'0';

    }






     ST7735_DrawCharS(19, 40, timearray[0], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(37, 40, timearray[1], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(55, 40, ':', digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(73, 40, timearray[2], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(91, 40, timearray[3], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(57, 70, ':', digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(75, 70, timearray[4], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(93, 70, timearray[5], digitalcolors[colorindex], ST7735_BLACK, 3);



if(alarmisPM){
     ST7735_DrawCharS(75, 100, 'P', digitalcolors[colorindex], ST7735_BLACK, 2);
     ST7735_DrawCharS(91, 100, 'M', digitalcolors[colorindex], ST7735_BLACK, 2);
}
else{
    ST7735_DrawCharS(75, 100, 'A', digitalcolors[colorindex], ST7735_BLACK, 2);
    ST7735_DrawCharS(91, 100, 'M', digitalcolors[colorindex], ST7735_BLACK, 2);



}	
			
			
			
			
			
		}
		else{
    if(hours>9){
      timearray[0]=hours/10+'0';
      timearray[1]=hours%10+'0';

    }
    else if(hours<=9){
      timearray[0]='0';
      timearray[1]=hours+'0';

    }

    if(minutes>9){
      timearray[2]=minutes/10+'0';
      timearray[3]=minutes%10+'0';
    }

    else if(minutes<=9){
      timearray[2]='0';
      timearray[3]=minutes+'0';

    }
    if(seconds>9){
      timearray[4]=seconds/10+'0';
      timearray[5]=seconds%10+'0';
    }
    else if(seconds<=9){
     timearray[4]='0';
     timearray[5]=seconds+'0';

    }






     ST7735_DrawCharS(19, 40, timearray[0], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(37, 40, timearray[1], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(55, 40, ':', digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(73, 40, timearray[2], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(91, 40, timearray[3], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(57, 70, ':', digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(75, 70, timearray[4], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(93, 70, timearray[5], digitalcolors[colorindex], ST7735_BLACK, 3);



if(isPM){
     ST7735_DrawCharS(75, 100, 'P', digitalcolors[colorindex], ST7735_BLACK, 2);
     ST7735_DrawCharS(91, 100, 'M', digitalcolors[colorindex], ST7735_BLACK, 2);
}
else{
    ST7735_DrawCharS(75, 100, 'A', digitalcolors[colorindex], ST7735_BLACK, 2);
    ST7735_DrawCharS(91, 100, 'M', digitalcolors[colorindex], ST7735_BLACK, 2);



}
}
		}
else if(digital==1){
        ST7735_DrawBitmap(25, 100, clock, 80, 80);
	           // ST7735_DrawLine(65, 60, 55, 55, ST7735_YELLOW); //10 hour hand
char prev_hours=60;
char prev_minutes=60;
//AI was used for debugging this switch statement
if(prev_hours!=hours){	
    switch(prev_hours){
        case 12: ST7735_DrawLine(65, 60, 65, 47, ST7735_BLACK); break;
        case 11: ST7735_DrawLine(65, 60, 55, 47, ST7735_BLACK); break;
        case 10: ST7735_DrawLine(65, 60, 55, 55, ST7735_BLACK); break;
        case 9:  ST7735_DrawLine(65, 60, 55, 60, ST7735_BLACK); break;
        case 8:  ST7735_DrawLine(65, 60, 55, 70, ST7735_BLACK); break;
        case 7:  ST7735_DrawLine(65, 60, 58, 73, ST7735_BLACK); break;
        case 6:  ST7735_DrawLine(65, 60, 65, 73, ST7735_BLACK); break;
        case 5:  ST7735_DrawLine(65, 60, 72, 72, ST7735_BLACK); break;
        case 4:  ST7735_DrawLine(65, 60, 75, 65, ST7735_BLACK); break;
        case 3:  ST7735_DrawLine(65, 60, 75, 60, ST7735_BLACK); break;
        case 2:  ST7735_DrawLine(65, 60, 75, 50, ST7735_BLACK); break;
        case 1:  ST7735_DrawLine(65, 60, 72, 47, ST7735_BLACK); break;
    }
	
    switch(hours){
        case 12: ST7735_DrawLine(65, 60, 65, 47, digitalcolors[colorindex]); break;
        case 11: ST7735_DrawLine(65, 60, 55, 47, digitalcolors[colorindex]); break;
        case 10: ST7735_DrawLine(65, 60, 55, 55, digitalcolors[colorindex]); break;
        case 9:  ST7735_DrawLine(65, 60, 55, 60, digitalcolors[colorindex]); break;
        case 8:  ST7735_DrawLine(65, 60, 55, 70, digitalcolors[colorindex]); break;
        case 7:  ST7735_DrawLine(65, 60, 58, 73, digitalcolors[colorindex]); break;
        case 6:  ST7735_DrawLine(65, 60, 65, 73, digitalcolors[colorindex]); break;
        case 5:  ST7735_DrawLine(65, 60, 72, 72, digitalcolors[colorindex]); break;
        case 4:  ST7735_DrawLine(65, 60, 75, 65, digitalcolors[colorindex]); break;
        case 3:  ST7735_DrawLine(65, 60, 75, 60, digitalcolors[colorindex]); break;
        case 2:  ST7735_DrawLine(65, 60, 75, 50, digitalcolors[colorindex]); break;
        case 1:  ST7735_DrawLine(65, 60, 72, 47, digitalcolors[colorindex]); break;
    }

		   // prev_hours = hours;  // update for next loop

