niranjannt/TM4C-IOT-Alarm-Clock/sw/src_TM4C/Lab4E_Main.c
	}
		    prev_hours = hours;  // update for next loop



	if(prev_minutes!=minutes){
		  switch(prev_minutes){
    case 59: ST7735_DrawLine(65, 60, 51, 37, ST7735_BLACK); //55 minute hand 
				break;
    case 58: ST7735_DrawLine(65, 60, 51, 37, ST7735_BLACK); //55 minute hand break; 
				break;
    case 57: ST7735_DrawLine(65, 60, 51, 37, ST7735_BLACK); //55 minute hand break;
				break;
    case 56: ST7735_DrawLine(65, 60, 51, 37, ST7735_BLACK); //55 minute hand break; 
				break;
    case 55: ST7735_DrawLine(65, 60, 51, 37, ST7735_BLACK); //55 minute hand break; 
				break;
    case 54: ST7735_DrawLine(65, 60, 36, 48, ST7735_BLACK); //50 minute hand
				break;
    case 53: ST7735_DrawLine(65, 60, 36, 48, ST7735_BLACK); //50 minute hand
				break;
    case 52: ST7735_DrawLine(65, 60, 36, 48, ST7735_BLACK); //50 minute hand
				break;
    case 51: ST7735_DrawLine(65, 60, 36, 48, ST7735_BLACK); //50 minute hand
				break;
    case 50: ST7735_DrawLine(65, 60, 36, 48, ST7735_BLACK); //50 minute hand
				break;
    case 49: 				ST7735_DrawLine(65, 60, 45, 60, ST7735_BLACK); //45 minute hand
break;
    case 48: 				ST7735_DrawLine(65, 60, 45, 60, ST7735_BLACK); //45 minute hand
 break; 
    case 47: 				ST7735_DrawLine(65, 60, 45, 60, ST7735_BLACK); //45 minute hand
 break;
    case 46: 				ST7735_DrawLine(65, 60, 45, 60, ST7735_BLACK); //45 minute hand
break;
    case 45: 				ST7735_DrawLine(65, 60, 45, 60, ST7735_BLACK); //45 minute hand
 break; 
    case 44: 						ST7735_DrawLine(65, 60, 37, 72, ST7735_BLACK); //40 minute hand
 break;
    case 43: 						ST7735_DrawLine(65, 60, 37, 72, ST7735_BLACK); //40 minute hand
 break;
    case 42: 						ST7735_DrawLine(65, 60, 37, 72, ST7735_BLACK); //40 minute hand
 break;
    case 41: 						ST7735_DrawLine(65, 60, 37, 72, ST7735_BLACK); //40 minute hand
 break;
    case 40: 						ST7735_DrawLine(65, 60, 37, 72, ST7735_BLACK); //40 minute hand
 break;
    case 39: 					ST7735_DrawLine(65, 60, 50, 83, ST7735_BLACK); //35 minute hand
 break;
    case 38: 					ST7735_DrawLine(65, 60, 50, 83, ST7735_BLACK); //35 minute hand
 break;
    case 37: 					ST7735_DrawLine(65, 60, 50, 83, ST7735_BLACK); //35 minute hand
 break;
    case 36: 					ST7735_DrawLine(65, 60, 50, 83, ST7735_BLACK); //35 minute hand
break;
    case 35: 					ST7735_DrawLine(65, 60, 50, 83, ST7735_BLACK); //35 minute hand
break;
    case 34: 		   ST7735_DrawLine(65, 60, 65, 80, ST7735_BLACK); //30 minute hand
 break;
    case 33: 		   ST7735_DrawLine(65, 60, 65, 80, ST7735_BLACK); //30 minute hand
 break;
    case 32: 		   ST7735_DrawLine(65, 60, 65, 80, ST7735_BLACK); //30 minute hand
 break;
    case 31: 		   ST7735_DrawLine(65, 60, 65, 80, ST7735_BLACK); //30 minute hand
 break;
    case 30: 		   ST7735_DrawLine(65, 60, 65, 80, ST7735_BLACK); //30 minute hand
 break; 
    case 29: 	    ST7735_DrawLine(65, 60, 76, 82, ST7735_BLACK); //25 minute hand
 break;
    case 28: 	    ST7735_DrawLine(65, 60, 76, 82, ST7735_BLACK); //25 minute hand
 break;
    case 27: 	    ST7735_DrawLine(65, 60, 76, 82, ST7735_BLACK); //25 minute hand
 break;
    case 26: 	    ST7735_DrawLine(65, 60, 76, 82, ST7735_BLACK); //25 minute hand
 break;
    case 25: 	    ST7735_DrawLine(65, 60, 76, 82, ST7735_BLACK); //25 minute hand
break;
    case 24:       ST7735_DrawLine(65, 60, 88, 75, ST7735_BLACK); //20 minute hand
 break;
    case 23:       ST7735_DrawLine(65, 60, 88, 75, ST7735_BLACK); //20 minute hand
 break;
    case 22:       ST7735_DrawLine(65, 60, 88, 75, ST7735_BLACK); //20 minute hand
 break;
    case 21:       ST7735_DrawLine(65, 60, 88, 75, ST7735_BLACK); //20 minute hand
 break;
    case 20:       ST7735_DrawLine(65, 60, 88, 75, ST7735_BLACK); //20 minute hand
 break;
    case 19:       ST7735_DrawLine(65, 60, 85, 60, ST7735_BLACK); //15 minute hand
 break;
    case 18:       ST7735_DrawLine(65, 60, 85, 60, ST7735_BLACK); //15 minute hand
 break;
    case 17:       ST7735_DrawLine(65, 60, 85, 60, ST7735_BLACK); //15 minute hand
 break;
    case 16:       ST7735_DrawLine(65, 60, 85, 60, ST7735_BLACK); //15 minute hand
 break;
    case 15:       ST7735_DrawLine(65, 60, 85, 60, ST7735_BLACK); //15 minute hand
 break;
    case 14: 			      ST7735_DrawLine(65, 60, 88, 47, ST7735_BLACK); //10 minute hand
 break;
    case 13: 			      ST7735_DrawLine(65, 60, 88, 47, ST7735_BLACK); //10 minute hand
 break;
    case 12: 			      ST7735_DrawLine(65, 60, 88, 47, ST7735_BLACK); //10 minute hand
 break;
    case 11: 			      ST7735_DrawLine(65, 60, 88, 47, ST7735_BLACK); //10 minute hand
 break;
    case 10: 			      ST7735_DrawLine(65, 60, 88, 47, ST7735_BLACK); //10 minute hand
 break;
    case 9:  	         ST7735_DrawLine(65, 60, 75, 37, ST7735_BLACK); //05 minute hand 
 break;
    case 8:  	         ST7735_DrawLine(65, 60, 75, 37, ST7735_BLACK); //05 minute hand 
 break;
    case 7:  	         ST7735_DrawLine(65, 60, 75, 37, ST7735_BLACK); //05 minute hand 
 break;
    case 6:  	         ST7735_DrawLine(65, 60, 75, 37, ST7735_BLACK); //05 minute hand 
 break;
    case 5:  	         ST7735_DrawLine(65, 60, 75, 37, ST7735_BLACK); //05 minute hand 
 break;
    case 4:  	       ST7735_DrawLine(65, 60, 65, 40, ST7735_BLACK); //0 minute hand
 break;
    case 3:  	       ST7735_DrawLine(65, 60, 65, 40, ST7735_BLACK); //0 minute hand
 break;
    case 2:  	       ST7735_DrawLine(65, 60, 65, 40, ST7735_BLACK); //0 minute hand
 break;
    case 1:  	       ST7735_DrawLine(65, 60, 65, 40, ST7735_BLACK); //0 minute hand
 break;
    case 0:  	       ST7735_DrawLine(65, 60, 65, 40, ST7735_BLACK); //0 minute hand
 break; 
}


		  switch(minutes){
    case 59: ST7735_DrawLine(65, 60, 51, 37, digitalcolors[colorindex]); //55 minute hand 
				break;
    case 58: ST7735_DrawLine(65, 60, 51, 37, digitalcolors[colorindex]); //55 minute hand break; 
				break;
    case 57: ST7735_DrawLine(65, 60, 51, 37, digitalcolors[colorindex]); //55 minute hand break;
				break;
    case 56: ST7735_DrawLine(65, 60, 51, 37, digitalcolors[colorindex]); //55 minute hand break; 
				break;
    case 55: ST7735_DrawLine(65, 60, 51, 37, digitalcolors[colorindex]); //55 minute hand break; 
				break;
    case 54: ST7735_DrawLine(65, 60, 36, 48, digitalcolors[colorindex]); //50 minute hand
				break;
    case 53: ST7735_DrawLine(65, 60, 36, 48, digitalcolors[colorindex]); //50 minute hand
				break;
    case 52: ST7735_DrawLine(65, 60, 36, 48, digitalcolors[colorindex]); //50 minute hand
				break;
    case 51: ST7735_DrawLine(65, 60, 36, 48, digitalcolors[colorindex]); //50 minute hand
				break;
    case 50: ST7735_DrawLine(65, 60, 36, 48, digitalcolors[colorindex]); //50 minute hand
				break;
    case 49: 				ST7735_DrawLine(65, 60, 45, 60, digitalcolors[colorindex]); //45 minute hand
break;
    case 48: 				ST7735_DrawLine(65, 60, 45, 60, digitalcolors[colorindex]); //45 minute hand
 break; 
    case 47: 				ST7735_DrawLine(65, 60, 45, 60, digitalcolors[colorindex]); //45 minute hand
 break;
    case 46: 				ST7735_DrawLine(65, 60, 45, 60, digitalcolors[colorindex]); //45 minute hand
break;
    case 45: 				ST7735_DrawLine(65, 60, 45, 60, digitalcolors[colorindex]); //45 minute hand
 break; 
    case 44: 						ST7735_DrawLine(65, 60, 37, 72, digitalcolors[colorindex]); //40 minute hand
 break;
    case 43: 						ST7735_DrawLine(65, 60, 37, 72, digitalcolors[colorindex]); //40 minute hand
 break;
    case 42: 						ST7735_DrawLine(65, 60, 37, 72, digitalcolors[colorindex]); //40 minute hand
 break;
    case 41: 						ST7735_DrawLine(65, 60, 37, 72, digitalcolors[colorindex]); //40 minute hand
 break;
    case 40: 						ST7735_DrawLine(65, 60, 37, 72, digitalcolors[colorindex]); //40 minute hand
 break;
    case 39: 					ST7735_DrawLine(65, 60, 50, 83, digitalcolors[colorindex]); //35 minute hand
 break;
    case 38: 					ST7735_DrawLine(65, 60, 50, 83, digitalcolors[colorindex]); //35 minute hand
 break;
    case 37: 					ST7735_DrawLine(65, 60, 50, 83, digitalcolors[colorindex]); //35 minute hand
 break;
    case 36: 					ST7735_DrawLine(65, 60, 50, 83, digitalcolors[colorindex]); //35 minute hand
break;
    case 35: 					ST7735_DrawLine(65, 60, 50, 83, digitalcolors[colorindex]); //35 minute hand
break;
    case 34: 		   ST7735_DrawLine(65, 60, 65, 80, digitalcolors[colorindex]); //30 minute hand
 break;
    case 33: 		   ST7735_DrawLine(65, 60, 65, 80, digitalcolors[colorindex]); //30 minute hand
 break;
    case 32: 		   ST7735_DrawLine(65, 60, 65, 80, digitalcolors[colorindex]); //30 minute hand
 break;
    case 31: 		   ST7735_DrawLine(65, 60, 65, 80, digitalcolors[colorindex]); //30 minute hand
 break;
    case 30: 		   ST7735_DrawLine(65, 60, 65, 80, digitalcolors[colorindex]); //30 minute hand
 break; 
    case 29: 	    ST7735_DrawLine(65, 60, 76, 82, digitalcolors[colorindex]); //25 minute hand
 break;
    case 28: 	    ST7735_DrawLine(65, 60, 76, 82, digitalcolors[colorindex]); //25 minute hand
 break;
    case 27: 	    ST7735_DrawLine(65, 60, 76, 82, digitalcolors[colorindex]); //25 minute hand
 break;
    case 26: 	    ST7735_DrawLine(65, 60, 76, 82, digitalcolors[colorindex]); //25 minute hand
 break;
    case 25: 	    ST7735_DrawLine(65, 60, 76, 82, digitalcolors[colorindex]); //25 minute hand
break;
    case 24:       ST7735_DrawLine(65, 60, 88, 75, digitalcolors[colorindex]); //20 minute hand
 break;
    case 23:       ST7735_DrawLine(65, 60, 88, 75, digitalcolors[colorindex]); //20 minute hand
 break;
    case 22:       ST7735_DrawLine(65, 60, 88, 75, digitalcolors[colorindex]); //20 minute hand
 break;
    case 21:       ST7735_DrawLine(65, 60, 88, 75, digitalcolors[colorindex]); //20 minute hand
 break;
    case 20:       ST7735_DrawLine(65, 60, 88, 75, digitalcolors[colorindex]); //20 minute hand
 break;
    case 19:       ST7735_DrawLine(65, 60, 85, 60, digitalcolors[colorindex]); //15 minute hand
 break;
    case 18:       ST7735_DrawLine(65, 60, 85, 60, digitalcolors[colorindex]); //15 minute hand
 break;
    case 17:       ST7735_DrawLine(65, 60, 85, 60, digitalcolors[colorindex]); //15 minute hand
 break;
    case 16:       ST7735_DrawLine(65, 60, 85, 60, digitalcolors[colorindex]); //15 minute hand
 break;
    case 15:       ST7735_DrawLine(65, 60, 85, 60, digitalcolors[colorindex]); //15 minute hand
 break;
    case 14: 			      ST7735_DrawLine(65, 60, 88, 47, digitalcolors[colorindex]); //10 minute hand
 break;
    case 13: 			      ST7735_DrawLine(65, 60, 88, 47, digitalcolors[colorindex]); //10 minute hand
 break;
    case 12: 			      ST7735_DrawLine(65, 60, 88, 47, digitalcolors[colorindex]); //10 minute hand
 break;
    case 11: 			      ST7735_DrawLine(65, 60, 88, 47, digitalcolors[colorindex]); //10 minute hand
 break;
    case 10: 			      ST7735_DrawLine(65, 60, 88, 47, digitalcolors[colorindex]); //10 minute hand
 break;
    case 9:  	         ST7735_DrawLine(65, 60, 75, 37, digitalcolors[colorindex]); //05 minute hand 
 break;
    case 8:  	         ST7735_DrawLine(65, 60, 75, 37, digitalcolors[colorindex]); //05 minute hand 
 break;
    case 7:  	         ST7735_DrawLine(65, 60, 75, 37, digitalcolors[colorindex]); //05 minute hand 
 break;
    case 6:  	         ST7735_DrawLine(65, 60, 75, 37, digitalcolors[colorindex]); //05 minute hand 
 break;
    case 5:  	         ST7735_DrawLine(65, 60, 75, 37, digitalcolors[colorindex]); //05 minute hand 
 break;
    case 4:  	       ST7735_DrawLine(65, 60, 65, 40, digitalcolors[colorindex]); //0 minute hand
 break;
    case 3:  	       ST7735_DrawLine(65, 60, 65, 40, digitalcolors[colorindex]); //0 minute hand
 break;
    case 2:  	       ST7735_DrawLine(65, 60, 65, 40, digitalcolors[colorindex]); //0 minute hand
 break;
    case 1:  	       ST7735_DrawLine(65, 60, 65, 40, digitalcolors[colorindex]); //0 minute hand
 break;
    case 0:  	       ST7735_DrawLine(65, 60, 65, 40, digitalcolors[colorindex]); //0 minute hand
 break; 
}
				//prev_minutes=minutes;

