niranjannt/TM4C-IOT-Alarm-Clock/sw/src_TM4C/Lab4E_Main.c
}
	prev_minutes=minutes;

}
else if(digital==2){
    //ST7735_InvertDisplay(1); //Comment out for Adafruit
    char timearray[6];
		if(alarm_display){
		if(alarmhours>9){
      timearray[0]=alarmhours/10+'0';
      timearray[1]=alarmhours%10+'0';

    }
    else if(alarmhours<=9){
      timearray[0]='0';
      timearray[1]=alarmhours+'0';

    }

    if(alarmminutes>9){
      timearray[2]=alarmminutes/10+'0';
      timearray[3]=alarmminutes%10+'0';
    }

    else if(alarmminutes<=9){
      timearray[2]='0';
      timearray[3]=alarmminutes+'0';

    }
    if(alarmseconds>9){
      timearray[4]=alarmseconds/10+'0';
      timearray[5]=alarmseconds%10+'0';
    }
    else if(alarmseconds<=9){
     timearray[4]='0';
     timearray[5]=alarmseconds+'0';

    }






     ST7735_DrawCharS(19, 40, timearray[0], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(37, 40, timearray[1], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(55, 40, ':', digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(73, 40, timearray[2], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(91, 40, timearray[3], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(57, 70, ':', digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(75, 70, timearray[4], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(93, 70, timearray[5], digitalcolors[colorindex], ST7735_BLACK, 3);



if(alarmisPM){
     ST7735_DrawCharS(75, 100, 'P', digitalcolors[colorindex], ST7735_BLACK, 2);
     ST7735_DrawCharS(91, 100, 'M', digitalcolors[colorindex], ST7735_BLACK, 2);
}
else{
    ST7735_DrawCharS(75, 100, 'A', digitalcolors[colorindex], ST7735_BLACK, 2);
    ST7735_DrawCharS(91, 100, 'M', digitalcolors[colorindex], ST7735_BLACK, 2);



}	
			
			
			
			
			
		}
		else{
			
		if(isPM){
		    if(hours>9 && hours!=12){
			twentyfourhours=hours;
			twentyfourhours=twentyfourhours+12;
      timearray[0]=twentyfourhours/10+'0';
      timearray[1]=twentyfourhours%10+'0';

    }
    else if(hours<=9 && hours!=12){
			twentyfourhours=hours;
			twentyfourhours=twentyfourhours+12;
      timearray[0]=twentyfourhours/10+'0';
      timearray[1]=twentyfourhours%10+'0';

    }
    else if(hours==12){
			timearray[0]=hours/10+'0';
      timearray[1]=hours%10+'0';

			
			
		}
    if(minutes>9){
      timearray[2]=minutes/10+'0';
      timearray[3]=minutes%10+'0';
    }

    else if(minutes<=9){
      timearray[2]='0';
      timearray[3]=minutes+'0';

    }
    if(seconds>9){
      timearray[4]=seconds/10+'0';
      timearray[5]=seconds%10+'0';
    }
    else if(seconds<=9){
     timearray[4]='0';
     timearray[5]=seconds+'0';

    }






     ST7735_DrawCharS(19, 40, timearray[0], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(37, 40, timearray[1], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(55, 40, ':', digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(73, 40, timearray[2], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(91, 40, timearray[3], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(57, 70, ':', digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(75, 70, timearray[4], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(93, 70, timearray[5], digitalcolors[colorindex], ST7735_BLACK, 3);

	
			
			
			
		}
		else{
    if(hours>9){
      timearray[0]=hours/10+'0';
      timearray[1]=hours%10+'0';

    }
    else if(hours<=9){
      timearray[0]='0';
      timearray[1]=hours+'0';

    }

    if(minutes>9){
      timearray[2]=minutes/10+'0';
      timearray[3]=minutes%10+'0';
    }

    else if(minutes<=9){
      timearray[2]='0';
      timearray[3]=minutes+'0';

    }
    if(seconds>9){
      timearray[4]=seconds/10+'0';
      timearray[5]=seconds%10+'0';
    }
    else if(seconds<=9){
     timearray[4]='0';
     timearray[5]=seconds+'0';

    }






     ST7735_DrawCharS(19, 40, timearray[0], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(37, 40, timearray[1], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(55, 40, ':', digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(73, 40, timearray[2], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(91, 40, timearray[3], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(57, 70, ':', digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(75, 70, timearray[4], digitalcolors[colorindex], ST7735_BLACK, 3);
     ST7735_DrawCharS(93, 70, timearray[5], digitalcolors[colorindex], ST7735_BLACK, 3);



	
	
	
}

		}


	}
}

void SysTick_Handler(void){
    timecounter++;
    if(timecounter>=5){
			if(!alarm_display){
        tickflag=1;
			}
			LED_Toggle();
       timecounter=0;
       if((hours==11)&&(minutes==59)&&(seconds==59)&&(isPM==1)){
           isPM=0;

       }
       else if((hours==11)&&(minutes==59)&&(seconds==59)&&(isPM==0)){
           isPM=1;

       }
       if(minutes==59 && seconds==59){
              hours = (hours % 12) + 1;
              minutes=0;
              seconds=0;
              }
       else if(seconds==59){
       minutes=(minutes+1)%60;
       seconds=0;
       }

       else{
   seconds++;
       }
				 
	if(alarmdisablecheck==0){
		if(hours==alarmhours && minutes==alarmminutes && seconds==alarmseconds && isPM==alarmisPM){
       alarmsound=1;
			 freeze=1;




		}				 
				 
				 
				 
				 
				 
			 }
			 
    }
	}









//void DAC4_Init(void){
//// Assumes LaunchPad_Init has been called
//// I.e., PortB has already been reset and activated (do not reset PortB here again)
//  // write this
// //Initialize PB0-PB4 as outputs
//    volatile uint32_t delay;
//      SYSCTL_RCGCGPIO_R |= 0x08;        // activate clock for Port E
//      delay = SYSCTL_RCGCGPIO_R;        // allow time for clock to start
//      GPIO_PORTD_DIR_R |= 0x01;         // set direction to output
//      GPIO_PORTD_DEN_R |= 0x01;         // enable digital port
//      GPIO_PORTD_DIR_R |= 0x02;         // set direction to output
//      GPIO_PORTD_DEN_R |= 0x02;         // enable digital port
//      GPIO_PORTD_DIR_R |= 0x04;         // set direction to output
//      GPIO_PORTD_DEN_R |= 0x04;         // enable digital port
//      GPIO_PORTD_DIR_R |= 0x08;         // set direction to output
//      GPIO_PORTD_DEN_R |= 0x08;


//// enable digital port

//}

void Timer1A_Handler(void){
  TIMER1_ICR_R = TIMER_ICR_TATOCINT;  // acknowledge timeout
  // Do stuff here (e.g., output DAC waveform)
//  if(tickflag){
// static uint32_t orange=0;
// GPIO_PORTB_DATA_R = (GPIO_PORTB_DATA_R&(~31)|ticks2[orange]);   // output one value
//    orange++;
//     if(orange>=2113){
//        tickflag=0;
//        orange=0;
//     }
//	 }
//		Switch statement to stop alarm debugged with ChatGPT
//uint32_t 	stopfreeze, stopfreezerelease;
			if(alarmsound){
				tickflag=0;
	static uint32_t alarmsoundtick=0;
 GPIO_PORTB_DATA_R = (GPIO_PORTB_DATA_R&(~31)|squareclock[alarmsoundtick]);   // output one value
    alarmsoundtick++;
     if(alarmsoundtick>=14){
        //tickflag=0;
        alarmsoundtick=0;
     }
	 }
		if(tickflag){
				static uint32_t alarmsoundtick=0;
 GPIO_PORTB_DATA_R = (GPIO_PORTB_DATA_R&(~31)|ticks2[alarmsoundtick]);   // output one value
    alarmsoundtick++;
     if(alarmsoundtick>=2113){
        tickflag=0;
        alarmsoundtick=0;
     }
	 }
			
		
  static uint32_t prevSwitch = 0;
  uint32_t currentSwitch = Switch_In4();

  if(currentSwitch == 0 && prevSwitch == 0){
		  alarmdisablecheck=1;
    alarmsound = 0;                 // Stop alarm
		freeze=0;
		tickflag=1;
  }
  prevSwitch = currentSwitch;
}



